name: "face_detection"
platform: "pytorch_libtorch"
default_model_filename: "script_scrfd.ts"

input: [
    {
        name: "INPUT__0"
        data_type: TYPE_FP32
        dims: [ 1920, 1080, 3 ]
    }
]

output: [
    {
        name: "OUTPUT__0"
        data_type: TYPE_FP32
        dims: [ 1920, 1080, 3 ]
    }
]

instance_group: [
    {
        count: 1
        kind: KIND_GPU
    }
]